#!/bin/bash
#(Цветно принтиране) Напишете shell script color_print, който взима два параметъра.

#Първият може да е измежду "-r", "-g" "-b", а вторият е произволен string.
#На командата "echo" може да се подаде код на цвят, който ще оцвети текста в определения цвят.
#В зависимост от първия аргумент, изпринтете втория аргумен в определения цвят:

#"-r" е червено. Кодът на червеното е '\033[0;31m' (echo -e "\033[0;31m This is red")
#"-g" е зелено. Кодът на зеленото е '\033[0;32m' (echo -e "\033[0;32m This is green")
#"-b" е синьо. Кодът на синьото е '\033[0;34m' (echo -e "\033[0;34m This is blue")
#Ако е подадена друга буква изпишете "Unknown colour", а ако изобщо не е подаден аргумент за цвят, просто изпишете текста.
#Hint:
#В края на скрипта си напишете:
#echo '\033[0m',за да не се прецакат цветовете на терминала. Това е цветът на "няма цвят".

if [ $# -ne 2 ] && [ $# -ne 1 ]
then
	echo "Usage: $0 [-r | -g | -b ] <string>"
	exit 1
fi

if [ $# -eq 2 ]
then 
	COLOR="f"
	if [ "${1}" = "-r" ]
	then
		COLOR="\033[0;31m"
	elif [ "${1}" = "-g" ]
	then
		COLOR="\033[0;032m"
	elif [ "${1}" = "-b" ]
	then
		COLOR="\033[0;34m"
	else
		echo "Invalid color option"
		exit 2
	fi
else 
	echo "$1"
	exit
fi

echo -e "${COLOR}${2}"
echo -ne '\033[0m'
